{
    "intents": [
        {
            "tag": "saludo",
            "patterns": [
                "hola",
                "qué tal",
                "cómo estás",
                "saludos",
                "buenos días",
                "buenas tardes",
                "buenas noches",
                "hey",
                "hola, qué tal",
                "cómo te va"
            ],
            "responses": [
                "¡Hola! ¿Cómo puedo asistirte con la información de UNEMI hoy?",
                "Buenos días, ¿en qué puedo ayudarte con respecto a UNEMI?",
                "Hola, ¿qué tal? ¿Tienes alguna pregunta sobre UNEMI?",
                "¡Hola! ¿Qué necesitas saber acerca de UNEMI?",
                "Buenas tardes, ¿cómo puedo asistirte con información de UNEMI?",
                "¡Buenas noches! ¿Hay algo relacionado con UNEMI en lo que pueda ayudarte?",
                "¡Hey! ¿Qué información de UNEMI buscas?",
                "Hola, ¿cómo te va hoy? ¿Necesitas saber algo sobre UNEMI?"
            ]
        },
        {
            "tag": "nombre",
            "patterns": [
                "cómo es tu nombre",
                "cómo te llamas",
                "cuál es tu nombre",
                "dime tu nombre",
                "cómo te llamas tú",
                "qué nombre tienes"
            ],
            "responses": [
                "Me llamo UNEMI-IA, y estoy aquí para ayudarte con información sobre UNEMI.",
                "Mi nombre es Juan Pablo. ¿Cómo puedo asistirte con tus preguntas sobre UNEMI?",
                "Soy UNEMI-IA, tu asistente virtual para todo lo relacionado con UNEMI.",
                "Puedes llamarme UNEMI-IA. Estoy aquí para proporcionarte detalles sobre UNEMI.",
                "Me conocen como UNEMI-IA. Estoy aquí para responder tus dudas sobre UNEMI."
            ]
        },
        {
            "tag": "vinculación",
            "patterns": [
                "qué es lo que haces",
                "a qué te dedicas",
                "cuál es tu función",
                "cómo me puedes ayudar",
                "qué servicios ofreces",
                "qué tareas realizas"
            ],
            "responses": [
                "Soy un asistente virtual especializado en información sobre UNEMI. Estoy aquí para ayudarte con tus preguntas.",
                "Puedo proporcionarte detalles sobre programas, eventos y noticias de UNEMI.",
                "Estoy aquí para ofrecerte asistencia en todo lo relacionado con UNEMI, desde información general hasta detalles específicos.",
                "Ofrezco asistencia con la información sobre UNEMI, incluyendo programas académicos, eventos y más. ¿Cómo puedo ayudarte?",
                "Estoy diseñado para responder a tus preguntas y proporcionarte información relevante sobre UNEMI. ¿Qué necesitas saber?"
            ]
        },
        {
            "tag": "carreras",
            "patterns": [
                "qué carreras ofrecen",
                "cuáles son las carreras disponibles",
                "qué programas académicos tienen",
                "dime sobre las carreras de UNEMI",
                "qué estudios puedo hacer en UNEMI",
                "qué opciones de carrera hay"
            ],
            "responses": [
                "En UNEMI ofrecemos una amplia gama de carreras, incluyendo Ingeniería en Sistemas, Administración de Empresas, Derecho, entre otras.",
                "Las carreras disponibles en UNEMI abarcan áreas como Ciencias de la Computación, Negocios, Ciencias Sociales, y más. ¿Te gustaría saber más sobre alguna en particular?",
                "UNEMI ofrece programas académicos en diversas áreas, como Ingeniería, Ciencias de la Salud, Arquitectura, y más. ¿Cuál te interesa?",
                "Puedes estudiar en UNEMI carreras como Ingeniería Industrial, Psicología, Educación, y muchas más. ¿Quieres información detallada sobre alguna carrera específica?",
                "En UNEMI contamos con una variedad de opciones de estudio, desde carreras técnicas hasta programas de posgrado. ¿Hay alguna carrera que te gustaría explorar?"
            ]
        },
        {
            "tag": "estudiantes",
            "patterns": [
                "qué servicios tienen para estudiantes",
                "cómo pueden ayudar a los estudiantes",
                "qué recursos están disponibles para los estudiantes",
                "dime sobre los beneficios para estudiantes",
                "qué apoyo ofrecen a los estudiantes",
                "cómo es la vida estudiantil en UNEMI"
            ],
            "responses": [
                "UNEMI ofrece varios servicios para estudiantes, incluyendo tutorías, apoyo académico, y actividades extracurriculares.",
                "Los estudiantes en UNEMI tienen acceso a recursos como bibliotecas, centros de estudio, y programas de desarrollo profesional.",
                "Contamos con una variedad de servicios de apoyo para estudiantes, como asesoramiento académico, becas, y actividades recreativas.",
                "En UNEMI, los estudiantes pueden disfrutar de beneficios como acceso a centros de investigación, oportunidades de prácticas y eventos universitarios.",
                "La vida estudiantil en UNEMI incluye actividades culturales, deportivas y académicas que enriquecen la experiencia universitaria. ¿Te gustaría saber más sobre algún aspecto específico?"
            ]
        }
    ]
}
